In [1]:
import pandas as pd

In [2]:
crops = pd.read_csv("crops.csv")
crops_df = pd.DataFrame(crops)
crops_df

             crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
..            ...      ...    ...     ...     ...
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

[100 rows x 5 columns]

In [3]:
df2=crops_df.sample(n=18) # Randomly selects 18 records from the dataframe
df2

             crop     year  area     msp  yields
77      eukalytus  2016-17  2585    9000  594550
14      greengram  2018-19    38    6975     190
93          tekku  2017-18    40  189000      10
11      greengram  2015-16    40    4850     200
68         sapota  2017-18    74    6200    2960
99  errachandanam  2018-19    12  209000      10
73        palmoil  2017-18  1915   38000  497900
42     cashew nut  2016-17   223   12000     446
70        palmoil  2014-15  1487   30000  386620
92          tekku  2016-17    34  175000      10
52          guava  2016-17   302    9600    3020
22         cotton  2016-17   135    3860     810
44     cashew nut  2018-19   189   19000     378
53          guava  2017-18   345    9700    3450
17       red gram  2016-17    16    4000      80
40     cashew nut  2014-15   284   10000     568
46         banana  2015-16   235    7000   43600
63        coconut  2017-18   152    1760   45600

In [4]:
df3 = crops_df.loc[51:75,['crop','year','area']]
print(df3) # Gives records from 51 - 75 for 3 columns

         crop     year  area
51      guava  2015-16   242
52      guava  2016-17   302
53      guava  2017-18   345
54      guava  2018-19   363
55      lemon  2014-15    49
56      lemon  2015-16    54
57      lemon  2016-17    67
58      lemon  2017-18    95
59      lemon  2018-19    95
60    coconut  2014-15   188
61    coconut  2015-16   169
62    coconut  2016-17   137
63    coconut  2017-18   152
64    coconut  2018-19   155
65     sapota  2014-15    21
66     sapota  2015-16    79
67     sapota  2016-17    68
68     sapota  2017-18    74
69     sapota  2018-19    70
70    palmoil  2014-15  1487
71    palmoil  2015-16  1792
72    palmoil  2016-17  1866
73    palmoil  2017-18  1915
74    palmoil  2018-19  1955
75  eukalptus  2014-15  2003

In [5]:
crops_df.loc[51:69] # Gives records from 51 - 69 for all columns

       crop     year  area    msp  yields
51    guava  2015-16   242   9500    2420
52    guava  2016-17   302   9600    3020
53    guava  2017-18   345   9700    3450
54    guava  2018-19   363  10000    3630
55    lemon  2014-15    49  15000     245
56    lemon  2015-16    54  15500     270
57    lemon  2016-17    67  16000     335
58    lemon  2017-18    95  17000     475
59    lemon  2018-19    95  17500     475
60  coconut  2014-15   188   1450   56400
61  coconut  2015-16   169   1500   50700
62  coconut  2016-17   137   1600   41100
63  coconut  2017-18   152   1760   45600
64  coconut  2018-19   155   2030   46100
65   sapota  2014-15    21   6000     840
66   sapota  2015-16    79   5000    3160
67   sapota  2016-17    68   5500    2720
68   sapota  2017-18    74   6200    2960
69   sapota  2018-19    70   6500    2800

In [6]:
crops_df.loc[84:,['crop','year','area']] # Gives records from 84 to end for 3 columns

             crop     year  area
84        malbari  2018-19    19
85     chedu vepa  2014-15    15
86     chedu vepa  2015-16    15
87     chedu vepa  2016-17    15
88     chedu vepa  2017-18    19
89     chedu vepa  2018-19    19
90          tekku  2014-15    25
91          tekku  2015-16    32
92          tekku  2016-17    34
93          tekku  2017-18    40
94          tekku  2018-19    40
95  errachandanam  2014-15     5
96  errachandanam  2015-16     5
97  errachandanam  2016-17     9
98  errachandanam  2017-18    10
99  errachandanam  2018-19    12

In [7]:
crops_df.iloc[10:20,[0,3,4]] # Gives rows 10–19 and only specific columns: 0, 3, and 4

         crop   msp  yields
10  greengram  4600     225
11  greengram  4850     200
12  greengram  5225     255
13  greengram  5575     200
14  greengram  6975     190
15    redgram  3175     168
16   red gram  3500      72
17   red gram  4000      80
18   red gram  4400     165
19   red gram  4600     150

In [8]:
crops_df.iloc[10:20,1:4] # Gives rows 10 to 19 and columns 1 to 3 using integer positions

       year  area   msp
10  2014-15    45  4600
11  2015-16    40  4850
12  2016-17    51  5225
13  2017-18    40  5575
14  2018-19    38  6975
15  2014-15    27  3175
16  2015-16    12  3500
17  2016-17    16  4000
18  2017-18    33  4400
19  2018-19    30  4600

In [9]:
crops_df.iloc[:,[0,2,4]] # Gives all rows and only specific columns: 0, 2, and 4

             crop   area  yields
0            rice  15759  378216
1            rice  15987  383688
2            rice  15747  377928
3            rice  15958  382992
4            rice  15848  380352
..            ...    ...     ...
95  errachandanam      5      10
96  errachandanam      5      10
97  errachandanam      9      10
98  errachandanam     10      10
99  errachandanam     12      10

[100 rows x 3 columns]

In [10]:
crops_df.iloc[:20] # Gives first 20 records for all columns

         crop     year   area   msp  yields
0        rice  2014-15  15759  1360  378216
1        rice  2015-16  15987  1414  383688
2        rice  2016-17  15747  1470  377928
3        rice  2017-18  15958  1550  382992
4        rice  2018-19  15848  1750  380352
5       maize  2014-15   1199  1310   29975
6       maize  2015-16   1227  1325   30675
7       maize  2016-17   1325  1365   33125
8       maize  2017-18   1369  1425   34225
9       maize  2018-19    951  1700   23775
10  greengram  2014-15     45  4600     225
11  greengram  2015-16     40  4850     200
12  greengram  2016-17     51  5225     255
13  greengram  2017-18     40  5575     200
14  greengram  2018-19     38  6975     190
15    redgram  2014-15     27  3175     168
16   red gram  2015-16     12  3500      72
17   red gram  2016-17     16  4000      80
18   red gram  2017-18     33  4400     165
19   red gram  2018-19     30  4600     150

In [11]:
crops_df.iloc[:,-1] # Gives all rows for the last column

0     378216
1     383688
2     377928
3     382992
4     380352
       ...
95        10
96        10
97        10
98        10
99        10
Name: yields, Length: 100, dtype: int64